#+title: Templates
** A longer example
As said above, the idea is that we now would like to create a class that does not really depend on specific choice of types, but really is always valid whatever the type we need.
For example, in [[file:overload_operators.org][overload of operators]] we have constructed a class MDouble, which is the analogue of double, but with some additional feature. What if we need to do the same for floats, long double,...? This is what templates are good for.

#+BEGIN_SRC C++ :results output :exports both :flags "-std=c++17" :cmdline "-o prog" :classname main
#include <iostream>
#include <cmath>
using namespace std;

//We define a template class
//This "depends" on the template object XXX
template <class XXX> class MDouble{
    bool error;
    XXX d; //The type will be "decided" once we specify what XXX is (in main)

    public:

        //This is a template function which uses the XXX template parameter
        MDouble<XXX> operator+(XXX s){
            MDouble<XXX> r = d; //Each time I use the class MDouble, I need to specify the template parameter XXX
            r.d += s;
            return r;
        }

        MDouble<XXX> operator/(XXX s){
            MDouble<XXX> r = d;
            r.error = s == 0.0;
            if(!r.error) r.d/=s;
            return r;
        }

        MDouble<XXX> operator-( ){
            d *= -1.0; return *this;}

        MDouble<XXX> operator+( ){
            return *this;}

        MDouble<XXX> operator+(MDouble<XXX> d){
            MDouble<XXX> r = this->d;
            r.d += d.d;
            return r;
        }

        MDouble<XXX> operator/(MDouble<XXX> d){
            MDouble<XXX> r = this->d;
            r.error = d.d == 0.0;
            if(!r.error) r.d /= d.d;
            return r;
        }

        //Template function with the attribute friend!
        template <typename YYY> friend MDouble<YYY> operator+(YYY, MDouble<YYY>);

        MDouble<XXX> operator+=(XXX s){
            d+=s;
            return *this;
        }

        MDouble<XXX> operator/=(XXX s){
            error = s == 0.0;
            if(!error) d/=s;
            return *this;
        }

        MDouble<XXX> operator+=(MDouble<XXX> s){
            d += s.d;
            return *this;
        }

        MDouble<XXX> operator/=(MDouble<XXX> s){
            error = s.d == 0.0;
            if(!error) d/=s.d;
            return *this;
        }

        //Template function that returns a reference to YYY
        template <class YYY> friend YYY& operator+=(YYY&, MDouble<YYY>);

        XXX operator%(XXX d){
            return d * this->d / 100.0;
        }

        XXX operator%(MDouble<XXX> d){
            return d.d * this->d / 100.0;
        }

        template <class YYY> friend YYY operator%(YYY, MDouble<YYY>);

        template <class YYY> friend ostream& operator<<(ostream &, MDouble<YYY>);

        template <class YYY> friend YYY exp(YYY);

        MDouble(XXX s) : d(s) {error = false;}

        bool ERROR( ){
            if(error) return !(error=false);
            return error;
        }

        XXX Getd( ){return d;}

        operator XXX(){return d;}
};


template <typename XXX> MDouble<XXX> operator+(XXX d, MDouble<XXX> D){
    MDouble<XXX> r = d;
    r.d += D.d;
    return r;
}

template <typename XXX> XXX& operator+=(XXX &d, MDouble<XXX> D){
    d += D.d;
    return d;
}

template <typename XXX> XXX operator % (XXX d, MDouble<XXX> D){
    return D.d * d / 100.0;
}

template <typename XXX> ostream& operator<<(ostream &o, MDouble<XXX> D){
    return o << D.d;
}

template <typename XXX> XXX exp(XXX x){
    XXX r = 1.0;
    r.d = exp(x.d);
    return r;
}

int main( ){

    //I am creating aliases for double and MDouble<double>
    using T = double;
    using D = MDouble<T>;


    T rate = 12.8, zero = 0, two = 2, one = 1;
    D tot = 34567.789;

    T (D::*d)(  ) = &D::Getd;
    cout << "I can use the pointer to member function \"d\""
        "\nto execute the function Getd and obtaining the private value of a variable of a Mdouble type, which is "
         << (tot .* d)(  ) << '\n';


    cout<< "I can compute double + MDouble: "<< rate + tot << '\n';
    cout << "But also MDouble + double: "<< tot + rate << '\n';
    cout<< "And also MDouble + MDouble: "<< tot + D(rate) << '\n';


    cout<< "Then I can compute the "<< rate << "% of " << tot
        << "\neither as MDouble % double: "<< tot % rate << '\n';
    cout<< "or double % Double: "
        << (T)tot % D(rate) << '\n';
    cout
        << "or as MDouble % MDouble: "<< tot  % D(rate) << '\n';

    cout<< "I can check if the division works fine:\n";
    if((tot /zero) . ERROR( ))cout << "ERROR! Division by 0\n";
    if(!(tot /= two) . ERROR( )) cout<< "However you can divide by 2: "<< tot << '\n';

    cout<< "I can also increment "<< tot << " by " << rate;
    cout<< " obtaining" << (tot += rate) << '\n';

    cout
        << "And also increase " << rate << " by the incremented value of " << tot << " getting ";

//Here the brackets are MANDATORY because << has precedence over +=!
    cout << (rate += tot) << '\n';

    cout << "I can apply the unary operator - to "<< tot << " getting ";
    cout << -tot << '\n';

    cout << "And increment with this the current value of "<< rate
         << "\nworking with operator+= between MDoubles, obtaining ";
    cout << (rate = (T)(D(rate) += tot)) << '\n';

    cout<< "Finally,  I can compute the exp of a MDouble "
        << D(rate) << " getting "
        << exp(D(rate)) << '\n'
        << "and also write the Napier's number e: "
        << exp(one) << '\n';
}
#+END_SRC

#+RESULTS:
#+begin_example
I can use the pointer to member function "d"
to execute the function Getd and obtaining the private value of a variable of a Mdouble type, which is 34567.8
I can compute double + MDouble: 34580.6
But also MDouble + double: 34580.6
And also MDouble + MDouble: 34580.6
Then I can compute the 12.8% of 34567.8
either as MDouble % double: 4424.68
or double % Double: 4424.68
or as MDouble % MDouble: 4424.68
I can check if the division works fine:
ERROR! Division by 0
However you can divide by 2: 17283.9
I can also increment 17283.9 by 12.8 obtaining17296.7
And also increase 12.8 by the incremented value of 17296.7 getting 17309.5
I can apply the unary operator - to 17296.7 getting -17296.7
And increment with this the current value of 17309.5
working with operator+= between MDoubles, obtaining 12.8
Finally,  I can compute the exp of a MDouble 12.8 getting 362217
and also write the Napier's number e: 2.71828
#+end_example

*** The problem of /dependent names/
These are names that _depend_ on some of the template parameters. For example
#+BEGIN_SRC C++
template <class X> void funz(){
    X::x * x;
}
#+END_SRC
Here /X::x/ is a name that depends on the template parameter X and it will assume different meaning depending on hwo funx is called.

For example,
#+BEGIN_SRC C++
#include<iostream>
using namespace std;
struct A {
    typedef int x; //It is an alias. This is the same as using x=int;
};

struct B {
    static const int x=1;
};

int x=3;

template <class X> void funz(){
    X::x * x;
}

int main(){
   funz<A>(); //In this case X::x *x creates a pointer to int
   funz<B>(); //In this case we multiply x in B with x in global scope
}
#+END_SRC

#+RESULTS: ERROR: dependent-name ‘X::x’ is parsed as a non-type

For this reason the compiler _needs_ to know if the dependent name is a type or not.
The compiler will assume that it is _not a type_ by default.
If we want to specify that _it is a type_ then we will write
#+BEGIN_SRC C++
template <class X> void funz(){
   typename X::x * x;
}
#+END_SRC

Consdier the following code
#+BEGIN_SRC C++
# include <iostream>
using namespace std;

template <class X> struct C1{

    //Define a template class INSIDE a template class
    template <class Y> struct C2{
        typedef double this_is_a_type;
    };

    //Define an ordinary class nested in the template
    struct this_is_a_type{
        //Which contains a template function
        template <class W> void gunz(){cout << "This is gunz!\n";}
    };
};

//Define a template function in the global scope
template <class Z> void funz(){
    //Case 1
    typename C1<Z>::this_is_a_type var;
    //Here I need to put typename to tell the compiler that this_is_a_type must be used as the name of a type

    //Case 2
    typename C1<Z>::template C2<int>::this_is_a_type d;
    //Here as above, but I want to use the this_is_a_type inside C2, and for this reason I need to put typename outside, to tell the compiler to treat what follows as the name of a type, but also :: template C2<...> otehrwise the bracket < after C2 would be an error!

    //Same as bfore, I need to specify that gunz is a template funtion other wise the angled brackets make no sense there!
    var.template gunz<int>();
}

int main(){
    funz<double>();
}
#+END_SRC

#+RESULTS:
: This is gunz!


Now consider this other example. In this case tehre is no need to put the word /typename/ because the compiler will know for sure that those are names of types!
In fact, ambiguities can onlu arise _when the scope resolutor operator is used_!

#+BEGIN_SRC C++ results output :exports both :flags "-std=c++11" :cmdline "-o prog" :classname main
# include <iostream>
using namespace std;

struct C1 {
    void gunza(){
        cout << "In C1 gunza without template arguments!\n";
    }

    template <class Y> void gunza(){
        Y y(22);
        cout << "In C1 gunza with template arguments! " << y << '\n';
    }
};

template <class X> struct C2 {
    void gunza(){
        cout << "In C2 gunza with no template arguments!\n";}
    template <class Y> void gunza(){
        Y y(33);
        cout << "Inside C2 gunza with template arguments!" << y << '\n';}
};

template <class Z> void funza(){
    Z var;
    C2 <Z> vor;
    var.gunza(  );
    var.template gunza<int>(  );
    vor.gunza(  );
    vor.template gunza<int>(  );
}

int main(  ) {
funza<C1>(  );
funza<C2<C1>>(  );
}
#+END_SRC

#+RESULTS:
| In     | C1 | gunza | without | template | arguments!   |            |
| In     | C1 | gunza | with    | template | arguments!   | 22         |
| In     | C2 | gunza | with    | no       | template     | arguments! |
| Inside | C2 | gunza | with    | template | arguments!33 |            |
| In     | C2 | gunza | with    | no       | template     | arguments! |
| Inside | C2 | gunza | with    | template | arguments!33 |            |
| In     | C2 | gunza | with    | no       | template     | arguments! |
| Inside | C2 | gunza | with    | template | arguments!33 |            |

